       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRSTVAR  PIC 9(8).

       PROCEDURE DIVISION.
           MOVE FUNCTION CURRENT-DATE(1:8) TO FIRSTVAR.
           DISPLAY FUNCTION UPPER-CASE("Hello world!") SPACE FIRSTVAR.

           STOP RUN.
